#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
module.cluster.data.confluent_service_account.service_account: Reading...
module.cluster.data.confluent_environment.env: Reading...
module.cluster.data.confluent_environment.env: Read complete after 0s [id=env-q26337]
module.cluster.data.confluent_service_account.service_account: Read complete after 0s [id=sa-yyj5p6]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cluster.confluent_api_key.service_account_kafka_api_key will be created
  + resource "confluent_api_key" "service_account_kafka_api_key" {
      + description            = "Kafka API Key that is owned by CC-WEBINAR service account"
      + disable_wait_for_ready = false
      + display_name           = "CC-WEBINAR_kafka_api_key"
      + id                     = (known after apply)
      + secret                 = (sensitive value)

      + managed_resource {
          + api_version = (known after apply)
          + id          = (known after apply)
          + kind        = (known after apply)

          + environment {
              + id = "env-q26337"
            }
        }

      + owner {
          + api_version = "iam/v2"
          + id          = "sa-yyj5p6"
          + kind        = "ServiceAccount"
        }
    }

  # module.cluster.confluent_kafka_cluster.cluster will be created
  + resource "confluent_kafka_cluster" "cluster" {
      + api_version        = (known after apply)
      + availability       = "SINGLE_ZONE"
      + bootstrap_endpoint = (known after apply)
      + cloud              = "GCP"
      + display_name       = "devops-webinar-standard-cluster-test"
      + id                 = (known after apply)
      + kind               = (known after apply)
      + rbac_crn           = (known after apply)
      + region             = "europe-west3"
      + rest_endpoint      = (known after apply)

      + environment {
          + id = "env-q26337"
        }

      + network {
          + id = (known after apply)
        }

      + standard {}
    }

  # module.cluster.confluent_role_binding.saccount_role[0] will be created
  + resource "confluent_role_binding" "saccount_role" {
      + crn_pattern = (known after apply)
      + id          = (known after apply)
      + principal   = "User:sa-yyj5p6"
      + role_name   = "CloudClusterAdmin"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @ogomezso, Action: `pull_request`*